frenzox/monitoring_example/boards/productx/cubemx/productx.ioc
#MicroXplorer Configuration settings - do not modify
Mcu.Family=STM32F3
ProjectManager.MainLocation=Core/Src
PA2.GPIO_PuPd=GPIO_PULLUP
RCC.MCOFreq_Value=64000000
PB13.GPIOParameters=GPIO_PuPd,GPIO_Label
RCC.USART1Freq_Value=32000000
RCC.CortexFreq_Value=64000000
RCC.TIM17Freq_Value=64000000
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32F301C8Tx
ADC1.Overrun=ADC_OVR_DATA_PRESERVED
PB10.GPIO_PuPd=GPIO_PULLUP
VP_ADC1_TempSens_Input.Mode=IN-TempSens
ADC1.ContinuousConvMode=ENABLE
PA10.GPIO_PuPd=GPIO_PULLUP
RCC.PLLCLKFreq_Value=64000000
PB14.GPIO_Label=UNUSED
PA14.GPIO_Label=UNUSED
RCC.SYSCLKSourceVirtual=RCC_SYSCLKSOURCE_PLLCLK
PA3.GPIO_PuPd=GPIO_PULLUP
PA0.GPIO_Label=HEARTBEAT_LED
PA12.GPIOParameters=GPIO_PuPd,GPIO_Label
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-true-HAL-true,2-SystemClock_Config-RCC-true-HAL-true,3-MX_ADC1_Init-ADC1-true-HAL-true
PA9.GPIOParameters=GPIO_PuPd,GPIO_Label
PA11.GPIOParameters=GPIO_PuPd,GPIO_Label
RCC.RTCFreq_Value=40000
PA3.GPIOParameters=GPIO_PuPd,GPIO_Label
PA6.GPIO_Label=UNUSED
PB0.GPIO_Label=ADC_TEMP
PB6.GPIO_Label=UNUSED
RCC.HSEPLLFreq_Value=16000000
PA11.GPIO_PuPd=GPIO_PULLUP
PB11.GPIO_PuPd=GPIO_PULLUP
PC13.GPIO_Label=UNUSED
PB13.GPIO_Label=UNUSED
PB11.Signal=GPIO_Input
PB13.Signal=GPIO_Input
PB15.Signal=GPIO_Input
PA2.GPIOParameters=GPIO_PuPd,GPIO_Label
PC14\ -\ OSC32_IN.Locked=true
PinOutPanel.RotationAngle=0
ProjectManager.StackSize=0x400
PB5.GPIOParameters=GPIO_PuPd,GPIO_Label
RCC.I2C3Freq_Value=8000000
RCC.FCLKCortexFreq_Value=64000000
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false
Mcu.IP2=RCC
Mcu.IP3=SYS
PA15.GPIO_Label=UNUSED
PB4.GPIOParameters=GPIO_PuPd,GPIO_Label
Mcu.IP0=ADC1
PA12.Locked=true
Mcu.IP1=NVIC
PA12.Signal=GPIO_Input
Mcu.UserConstants=
Mcu.ThirdPartyNb=0
ADC1.Offset-0\#ChannelRegularConversion=0
PB1.GPIO_PuPd=GPIO_PULLUP
RCC.HCLKFreq_Value=64000000
Mcu.IPNb=4
RCC.I2SClocksFreq_Value=64000000
ProjectManager.PreviousToolchain=
RCC.APB2TimFreq_Value=64000000
PB6.Signal=GPIO_Input
PA8.GPIOParameters=GPIO_PuPd,GPIO_Label
Mcu.Pin6=PA1
Mcu.Pin7=PA2
ADC1.SubFamily=STM32F301x8
Mcu.Pin8=PA3
Mcu.Pin9=PA4
PA1.GPIO_PuPd=GPIO_PULLUP
RCC.AHBFreq_Value=64000000
PB13.Locked=true
RCC.TIM2Freq_Value=64000000
Mcu.Pin0=PC13
Mcu.Pin1=PC14 - OSC32_IN
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PC15 - OSC32_OUT
PC15\ -\ OSC32_OUT.Signal=GPIO_Input
Mcu.Pin3=PF0-OSC_IN
Mcu.Pin4=PF1-OSC_OUT
Mcu.Pin5=PA0
PC15\ -\ OSC32_OUT.GPIOParameters=GPIO_PuPd,GPIO_Label
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_11
ProjectManager.ProjectBuild=false
RCC.HSE_VALUE=16000000
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:false\:false\:false
PA0.Locked=true
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:false\:false\:false
PA4.GPIO_PuPd=GPIO_PULLUP
PB2.Signal=GPIO_Input
PA8.Locked=true
PA4.Locked=true
NVIC.SysTick_IRQn=true\:1\:1\:true\:false\:false\:false\:false
RCC.PLLMUL=RCC_PLL_MUL4
PB12.GPIO_Label=UNUSED
ProjectManager.FirmwarePackage=STM32Cube FW_F3 V1.11.1
VP_ADC1_Vref_Input.Mode=IN-Vrefint
MxDb.Version=DB.6.0.0
PB0.GPIOParameters=GPIO_Label
PA13.GPIO_PuPd=GPIO_PULLUP
PA6.GPIO_PuPd=GPIO_PULLUP
PB3.GPIO_PuPd=GPIO_PULLUP
PA1.GPIOParameters=GPIO_PuPd,GPIO_Label
ProjectManager.BackupPrevious=false
PA5.GPIO_PuPd=GPIO_PULLUP
PB1.GPIO_Label=UNUSED
File.Version=6
PA10.GPIO_Label=UNUSED
PC13.GPIO_PuPd=GPIO_PULLUP
PB3.GPIOParameters=GPIO_PuPd,GPIO_Label
PB7.Signal=GPIO_Input
PA8.Signal=GPIO_Input
PB8.Locked=true
PB6.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:false\:false\:false
PB6.GPIOParameters=GPIO_PuPd,GPIO_Label
ProjectManager.HalAssertFull=false
PB2.GPIO_PuPd=GPIO_PULLUP
PB0.Locked=true
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_1CYCLE_5
ProjectManager.ProjectName=productx
PA0.Signal=GPIO_Input
RCC.TIM1Freq_Value=64000000
PA13.GPIOParameters=GPIO_PuPd,GPIO_Label
RCC.PLLMCOFreq_Value=64000000
PB7.GPIO_Label=UNUSED
Mcu.Package=LQFP48
PB9.Signal=GPIO_Input
PB14.GPIO_PuPd=GPIO_PULLUP
PB1.Signal=GPIO_Input
PA6.Signal=GPIO_Input
RCC.TIM15Freq_Value=64000000
PA7.Locked=true
PA5.Locked=true
ADC1.EnableInjectedConversion=DISABLE
PB15.GPIO_PuPd=GPIO_PULLUP
PA14.Locked=true
PA0.GPIO_PuPd=GPIO_PULLUP
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=UNUSED
RCC.LSI_VALUE=40000
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PA10.Signal=GPIO_Input
PB9.GPIO_PuPd=GPIO_PULLUP
PA15.Signal=GPIO_Input
PA5.GPIOParameters=GPIO_PuPd,GPIO_Label
PB14.GPIOParameters=GPIO_PuPd,GPIO_Label
RCC.TIM16Freq_Value=64000000
PB5.GPIO_Label=UNUSED
RCC.APB1TimFreq_Value=64000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:false\:false\:false
PB10.GPIOParameters=GPIO_PuPd,GPIO_Label
PF1-OSC_OUT.Mode=HSE-External-Oscillator
PA12.GPIO_PuPd=GPIO_PULLUP
PC14\ -\ OSC32_IN.GPIOParameters=GPIO_PuPd,GPIO_Label
PA4.GPIO_Label=UNUSED
ProjectManager.CustomerFirmwarePackage=
PF1-OSC_OUT.Signal=RCC_OSC_OUT
PB15.Locked=true
PB3.Locked=true
PB4.Signal=GPIO_Input
PA3.Signal=GPIO_Input
PA2.Locked=true
PB3.GPIO_Label=UNUSED
PA6.GPIOParameters=GPIO_PuPd,GPIO_Label
PB7.GPIO_PuPd=GPIO_PULLUP
RCC.PLLSourceVirtual=RCC_PLLSOURCE_HSE
ProjectManager.ProjectFileName=productx.ioc
RCC.ADC12outputFreq_Value=64000000
PB8.GPIOParameters=GPIO_PuPd,GPIO_Label
ADC1.Rank-0\#ChannelRegularConversion=1
PB9.GPIO_Label=UNUSED
PA15.GPIOParameters=GPIO_PuPd,GPIO_Label
Mcu.PinsNb=40
ProjectManager.NoMain=true
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,Offset-0\#ChannelRegularConversion,NbrOfConversionFlag,EnableInjectedConversion,ClockPrescaler,ContinuousConvMode,Overrun,NbrOfConversion,master,SubFamily
PC13.Locked=true
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
PC13.Signal=GPIO_Input
PA9.GPIO_Label=UNUSED
PB6.GPIO_PuPd=GPIO_PULLUP
PB8.GPIO_PuPd=GPIO_PULLUP
PB11.GPIO_Label=UNUSED
PA11.GPIO_Label=UNUSED
ProjectManager.DefaultFWLocation=true
PB12.Locked=true
ProjectManager.DeletePrevious=true
RCC.HSIPLLFreq_Value=4000000
PB14.Locked=true
RCC.APB1CLKDivider=RCC_HCLK_DIV2
PB10.Locked=true
PA9.GPIO_PuPd=GPIO_PULLUP
PA12.GPIO_Label=UNUSED
RCC.FamilyName=M
PB9.GPIOParameters=GPIO_PuPd,GPIO_Label
PA13.Signal=GPIO_Input
PB8.GPIO_Label=UNUSED
PA11.Locked=true
PA15.Locked=true
PA8.GPIO_Label=UNUSED
ProjectManager.TargetToolchain=Makefile
PB10.GPIO_Label=UNUSED
PB7.GPIOParameters=GPIO_PuPd,GPIO_Label
PB2.GPIOParameters=GPIO_PuPd,GPIO_Label
PA9.Signal=GPIO_Input
PB11.GPIOParameters=GPIO_PuPd,GPIO_Label
PB5.Locked=true
PB9.Locked=true
PB4.GPIO_PuPd=GPIO_PULLUP
ProjectManager.RegisterCallBack=
PC14\ -\ OSC32_IN.GPIO_Label=UNUSED
RCC.LSE_VALUE=32768
PA1.Signal=GPIO_Input
PA7.GPIO_PuPd=GPIO_PULLUP
PB1.Locked=true
PF0-OSC_IN.Mode=HSE-External-Oscillator
PB10.Signal=GPIO_Input
PC15\ -\ OSC32_OUT.GPIO_PuPd=GPIO_PULLUP
PB14.Signal=GPIO_Input
PA5.Signal=GPIO_Input
PB0.Mode=IN11-Single-Ended
board=custom
ProjectManager.LastFirmware=false
PB13.GPIO_PuPd=GPIO_PULLUP
RCC.VCOOutput2Freq_Value=16000000
PC15\ -\ OSC32_OUT.GPIO_Label=UNUSED
RCC.APB2Freq_Value=64000000
MxCube.Version=6.0.1
PB4.GPIO_Label=UNUSED
Mcu.Pin37=VP_ADC1_TempSens_Input
Mcu.Pin38=VP_ADC1_Vref_Input
PB15.GPIO_Label=UNUSED
Mcu.Pin35=PB8
RCC.I2C1Freq_Value=8000000
Mcu.Pin36=PB9
PC13.GPIOParameters=GPIO_PuPd,GPIO_Label
Mcu.Pin39=VP_SYS_VS_Systick
VP_ADC1_TempSens_Input.Signal=ADC1_TempSens_Input
Mcu.Pin30=PB3
PA1.GPIO_Label=UNUSED
PA10.GPIOParameters=GPIO_PuPd,GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
Mcu.Pin33=PB6
VP_ADC1_Vref_Input.Signal=ADC1_Vref_Input
Mcu.Pin34=PB7
Mcu.Pin31=PB4
Mcu.Pin32=PB5
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:false\:false\:false
PA4.GPIOParameters=GPIO_PuPd,GPIO_Label
PA14.GPIO_PuPd=GPIO_PULLUP
PB15.GPIOParameters=GPIO_PuPd,GPIO_Label
ADC1.NbrOfConversion=1
ProjectManager.FreePins=true
RCC.IPParameters=ADC12outputFreq_Value,AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,FCLKCortexFreq_Value,FamilyName,HCLKFreq_Value,HSEPLLFreq_Value,HSE_VALUE,HSIPLLFreq_Value,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2SClocksFreq_Value,LSE_VALUE,LSI_VALUE,MCOFreq_Value,PLLCLKFreq_Value,PLLMCOFreq_Value,PLLMUL,PLLSourceVirtual,RTCFreq_Value,RTCHSEDivFreq_Value,SYSCLKFreq_VALUE,SYSCLKSourceVirtual,TIM15Freq_Value,TIM16Freq_Value,TIM17Freq_Value,TIM1Freq_Value,TIM2Freq_Value,USART1Freq_Value,VCOOutput2Freq_Value
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F301C(6-8)Tx
Mcu.Pin26=PA12
Mcu.Pin27=PA13
RCC.RTCHSEDivFreq_Value=500000
PA2.Signal=GPIO_Input
Mcu.Pin24=PA10
PA13.GPIO_Label=UNUSED
ProjectManager.UnderRoot=false
Mcu.Pin25=PA11
PB2.Locked=true
PC15\ -\ OSC32_OUT.Locked=true
Mcu.Pin28=PA14
Mcu.Pin29=PA15
ProjectManager.CoupleFile=true
PB4.Locked=true
PB3.Signal=GPIO_Input
PA4.Signal=GPIO_Input
RCC.SYSCLKFreq_VALUE=64000000
Mcu.Pin22=PA8
PB5.Signal=GPIO_Input
Mcu.Pin23=PA9
PA1.Locked=true
PA7.GPIO_Label=UNUSED
Mcu.Pin20=PB14
ADC1.master=1
PA3.Locked=true
Mcu.Pin21=PB15
PA5.GPIO_Label=UNUSED
PA10.Locked=true
NVIC.ForceEnableDMAVector=true
KeepUserPlacement=false
PA14.GPIOParameters=GPIO_PuPd,GPIO_Label
PB5.GPIO_PuPd=GPIO_PULLUP
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:false\:false\:false
PA13.Locked=true
ProjectManager.CompilerOptimize=6
PA11.Signal=GPIO_Input
PA14.Signal=GPIO_Input
PB2.GPIO_Label=UNUSED
ProjectManager.HeapSize=0x0
PA0.GPIOParameters=GPIO_PuPd,GPIO_Label
Mcu.Pin15=PB2
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:false\:false\:false
Mcu.Pin16=PB10
Mcu.Pin13=PB0
Mcu.Pin14=PB1
Mcu.Pin19=PB13
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PB11
RCC.HSI_VALUE=8000000
Mcu.Pin18=PB12
PA8.GPIO_PuPd=GPIO_PULLUP
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_2
ADC1.NbrOfConversionFlag=1
Mcu.Pin11=PA6
Mcu.Pin12=PA7
Mcu.Pin10=PA5
PA15.GPIO_PuPd=GPIO_PULLUP
PB7.Locked=true
PB8.Signal=GPIO_Input
PF0-OSC_IN.Signal=RCC_OSC_IN
PB12.GPIO_PuPd=GPIO_PULLUP
RCC.I2C2Freq_Value=8000000
RCC.APB1Freq_Value=32000000
PB0.Signal=ADC1_IN11
ADC1.ClockPrescaler=ADC_CLOCK_SYNC_PCLK_DIV4
PA7.GPIOParameters=GPIO_PuPd,GPIO_Label
PC14\ -\ OSC32_IN.GPIO_PuPd=GPIO_PULLUP
PB11.Locked=true
ProjectManager.DeviceId=STM32F301C8Tx
PB12.GPIOParameters=GPIO_PuPd,GPIO_Label
PB12.Signal=GPIO_Input
ProjectManager.LibraryCopy=2
PA3.GPIO_Label=UNUSED
PB1.GPIOParameters=GPIO_PuPd,GPIO_Label
PA7.Signal=GPIO_Input
PC14\ -\ OSC32_IN.Signal=GPIO_Input
PA6.Locked=true
